[
    {
        "settingId": "extensions.autoCheckUpdates",
        "desc": " When enabled, automatically checks extensions for updates. If an extension has an update, it is marked as outdated in the Extensions view. The updates are fetched from a Microsoft online service.",
        "setting": {
            "extensions.autoCheckUpdates": true
        }
    },
    {
        "settingId": "extensions.autoUpdate",
        "desc": " Controls the automatic update behavior of extensions. The updates are fetched from a Microsoft online service.\n  - true: Download and install updates automatically for all extensions except for those updates are ignored.\n  - onlyEnabledExtensions: Download and install updates automatically only for enabled extensions except for those updates are ignored. Disabled extensions are not updated automatically.\n  - onlySelectedExtensions: Download and install updates automatically only for selected extensions.\n  - false: Extensions are not automatically updated.",
        "setting": {
            "extensions.autoUpdate": true
        }
    },
    {
        "settingId": "extensions.closeExtensionDetailsOnViewChange",
        "desc": " When enabled, editors with extension details will be automatically closed upon navigating away from the Extensions View.",
        "setting": {
            "extensions.closeExtensionDetailsOnViewChange": false
        }
    },
    {
        "settingId": "extensions.confirmedUriHandlerExtensionIds",
        "desc": " When an extension is listed here, a confirmation prompt will not be shown when that extension handles a URI.",
        "setting": {
            "extensions.confirmedUriHandlerExtensionIds": []
        }
    },
    {
        "settingId": "extensions.ignoreRecommendations",
        "desc": " When enabled, the notifications for extension recommendations will not be shown.",
        "setting": {
            "extensions.ignoreRecommendations": false
        }
    },
    {
        "settingId": "extensions.supportUntrustedWorkspaces",
        "desc": " Override the untrusted workspace support of an extension. Extensions using `true` will always be enabled. Extensions using `limited` will always be enabled, and the extension will hide functionality that requires trust. Extensions using `false` will only be enabled only when the workspace is trusted.",
        "setting": {
            "extensions.supportUntrustedWorkspaces": {}
        }
    },
    {
        "settingId": "extensions.supportVirtualWorkspaces",
        "desc": " Override the virtual workspaces support of an extension.",
        "setting": {
            "extensions.supportVirtualWorkspaces": {}
        }
    },
    {
        "settingId": "extensions.webWorker",
        "desc": " Enable web worker extension host.\n  - true: The Web Worker Extension Host will always be launched.\n  - false: The Web Worker Extension Host will never be launched.\n  - auto: The Web Worker Extension Host will be launched when a web extension needs it.",
        "setting": {
            "extensions.webWorker": "auto"
        }
    }
]