[
    {
        "settingId": "remote.tunnels.access.hostNameOverride",
        "desc": " The name under which the remote tunnel access is registered. If not set, the host name is used.",
        "setting": {
            "remote.tunnels.access.hostNameOverride": ""
        }
    },
    {
        "settingId": "remote.tunnels.access.preventSleep",
        "desc": " Prevent the computer from sleeping when remote tunnel access is turned on.",
        "setting": {
            "remote.tunnels.access.preventSleep": false
        }
    },
    {
        "settingId": "remote.autoForwardPorts",
        "desc": " When enabled, new running processes are detected and ports that they listen on are automatically forwarded. Disabling this setting will not prevent all ports from being forwarded. Even when disabled, extensions will still be able to cause ports to be forwarded, and opening some URLs will still cause ports to forwarded.",
        "setting": {
            "remote.autoForwardPorts": true
        }
    },
    {
        "settingId": "remote.autoForwardPortsFallback",
        "desc": " The number of auto forwarded ports that will trigger the switch from `process` to `hybrid` when automatically forwarding ports and `remote.autoForwardPortsSource` is set to `process`. Set to `0` to disable the fallback.",
        "setting": {
            "remote.autoForwardPortsFallback": 20
        }
    },
    {
        "settingId": "remote.autoForwardPortsSource",
        "desc": " Sets the source from which ports are automatically forwarded when `remote.autoForwardPorts` is true. On Windows and macOS remotes, the `process` and `hybrid` options have no effect and `output` will be used.\n  - process: Ports will be automatically forwarded when discovered by watching for processes that are started and include a port.\n  - output: Ports will be automatically forwarded when discovered by reading terminal and debug output. Not all processes that use ports will print to the integrated terminal or debug console, so some ports will be missed. Ports forwarded based on output will not be \"un-forwarded\" until reload or until the port is closed by the user in the Ports view.\n  - hybrid: Ports will be automatically forwarded when discovered by reading terminal and debug output. Not all processes that use ports will print to the integrated terminal or debug console, so some ports will be missed. Ports will be \"un-forwarded\" by watching for processes that listen on that port to be terminated.",
        "setting": {
            "remote.autoForwardPortsSource": "process"
        }
    },
    {
        "settingId": "remote.downloadExtensionsLocally",
        "desc": " When enabled extensions are downloaded locally and installed on remote.",
        "setting": {
            "remote.downloadExtensionsLocally": false
        }
    },
    {
        "settingId": "remote.extensionKind",
        "desc": " Override the kind of an extension. `ui` extensions are installed and run on the local machine while `workspace` extensions are run on the remote. By overriding an extension's default kind using this setting, you specify if that extension should be installed and enabled locally or remotely.",
        "setting": {
            "remote.extensionKind": {
                "pub.name": [
                    "ui"
                ]
            }
        }
    },
    {
        "settingId": "remote.forwardOnOpen",
        "desc": " Controls whether local URLs with a port will be forwarded when opened from the terminal and the debug console.",
        "setting": {
            "remote.forwardOnOpen": true
        }
    },
    {
        "settingId": "remote.localPortHost",
        "desc": " Specifies the local host name that will be used for port forwarding.",
        "setting": {
            "remote.localPortHost": "localhost"
        }
    },
    {
        "settingId": "remote.otherPortsAttributes",
        "desc": " Set default properties that are applied to all ports that don't get properties from the setting `remote.portsAttributes`.",
        "setting": {
            "remote.otherPortsAttributes": {}
        }
    },
    {
        "settingId": "remote.portsAttributes",
        "desc": " Set properties that are applied when a specific port number is forwarded.",
        "setting": {
            "remote.portsAttributes": {}
        }
    },
    {
        "settingId": "remote.restoreForwardedPorts",
        "desc": " Restores the ports you forwarded in a workspace.",
        "setting": {
            "remote.restoreForwardedPorts": true
        }
    }
]