[
    {
        "settingId": "scm.alwaysShowActions",
        "desc": " Controls whether inline actions are always visible in the Source Control view.",
        "setting": {
            "scm.alwaysShowActions": false
        }
    },
    {
        "settingId": "scm.alwaysShowRepositories",
        "desc": " Controls whether repositories should always be visible in the Source Control view.",
        "setting": {
            "scm.alwaysShowRepositories": false
        }
    },
    {
        "settingId": "scm.autoReveal",
        "desc": " Controls whether the Source Control view should automatically reveal and select files when opening them.",
        "setting": {
            "scm.autoReveal": true
        }
    },
    {
        "settingId": "scm.countBadge",
        "desc": " Controls the count badge on the Source Control icon on the Activity Bar.\n  - all: Show the sum of all Source Control Provider count badges.\n  - focused: Show the count badge of the focused Source Control Provider.\n  - off: Disable the Source Control count badge.",
        "setting": {
            "scm.countBadge": "all"
        }
    },
    {
        "settingId": "scm.defaultViewMode",
        "desc": " Controls the default Source Control repository view mode.\n  - tree: Show the repository changes as a tree.\n  - list: Show the repository changes as a list.",
        "setting": {
            "scm.defaultViewMode": "list"
        }
    },
    {
        "settingId": "scm.defaultViewSortKey",
        "desc": " Controls the default Source Control repository changes sort order when viewed as a list.\n  - name: Sort the repository changes by file name.\n  - path: Sort the repository changes by path.\n  - status: Sort the repository changes by Source Control status.",
        "setting": {
            "scm.defaultViewSortKey": "path"
        }
    },
    {
        "settingId": "scm.diffDecorations",
        "desc": " Controls diff decorations in the editor.\n  - all: Show the diff decorations in all available locations.\n  - gutter: Show the diff decorations only in the editor gutter.\n  - overview: Show the diff decorations only in the overview ruler.\n  - minimap: Show the diff decorations only in the minimap.\n  - none: Do not show the diff decorations.",
        "setting": {
            "scm.diffDecorations": "all"
        }
    },
    {
        "settingId": "scm.diffDecorationsGutterAction",
        "desc": " Controls the behavior of Source Control diff gutter decorations.\n  - diff: Show the inline diff Peek view on click.\n  - none: Do nothing.",
        "setting": {
            "scm.diffDecorationsGutterAction": "diff"
        }
    },
    {
        "settingId": "scm.diffDecorationsGutterPattern",
        "desc": " Controls whether a pattern is used for the diff decorations in gutter.",
        "setting": {
            "scm.diffDecorationsGutterPattern": {
                "added": false,
                "modified": true
            }
        }
    },
    {
        "settingId": "scm.diffDecorationsGutterVisibility",
        "desc": " Controls the visibility of the Source Control diff decorator in the gutter.\n  - always: Show the diff decorator in the gutter at all times.\n  - hover: Show the diff decorator in the gutter only on hover.",
        "setting": {
            "scm.diffDecorationsGutterVisibility": "always"
        }
    },
    {
        "settingId": "scm.diffDecorationsGutterWidth",
        "desc": " Controls the width(px) of diff decorations in gutter (added & modified).",
        "setting": {
            "scm.diffDecorationsGutterWidth": 3
        }
    },
    {
        "settingId": "scm.diffDecorationsIgnoreTrimWhitespace",
        "desc": " Controls whether leading and trailing whitespace is ignored in Source Control diff gutter decorations.\n  - true: Ignore leading and trailing whitespace.\n  - false: Do not ignore leading and trailing whitespace.\n  - inherit: Inherit from `diffEditor.ignoreTrimWhitespace`.",
        "setting": {
            "scm.diffDecorationsIgnoreTrimWhitespace": "false"
        }
    },
    {
        "settingId": "scm.inputFontFamily",
        "desc": " Controls the font for the input message. Use `default` for the workbench user interface font family, `editor` for the `editor.fontFamily`'s value, or a custom font family.",
        "setting": {
            "scm.inputFontFamily": "default"
        }
    },
    {
        "settingId": "scm.inputFontSize",
        "desc": " Controls the font size for the input message in pixels.",
        "setting": {
            "scm.inputFontSize": 13
        }
    },
    {
        "settingId": "scm.inputMaxLineCount",
        "desc": " Controls the maximum number of lines that the input will auto-grow to.",
        "setting": {
            "scm.inputMaxLineCount": 10
        }
    },
    {
        "settingId": "scm.inputMinLineCount",
        "desc": " Controls the minimum number of lines that the input will auto-grow from.",
        "setting": {
            "scm.inputMinLineCount": 1
        }
    },
    {
        "settingId": "scm.providerCountBadge",
        "desc": " Controls the count badges on Source Control Provider headers.\n  - hidden: Hide Source Control Provider count badges.\n  - auto: Only show count badge for Source Control Provider when non-zero.\n  - visible: Show Source Control Provider count badges.",
        "setting": {
            "scm.providerCountBadge": "hidden"
        }
    },
    {
        "settingId": "scm.repositories.sortOrder",
        "desc": " Controls the sort order of the repositories in the source control repositories view.\n  - discovery time: Repositories in the Source Control Repositories view are sorted by discovery time. Repositories in the Source Control view are sorted in the order that they were selected.\n  - name: Repositories in the Source Control Repositories and Source Control views are sorted by repository name.\n  - path: Repositories in the Source Control Repositories and Source Control views are sorted by repository path.",
        "setting": {
            "scm.repositories.sortOrder": "discovery time"
        }
    },
    {
        "settingId": "scm.repositories.visible",
        "desc": " Controls how many repositories are visible in the Source Control Repositories section. Set to 0, to be able to manually resize the view.",
        "setting": {
            "scm.repositories.visible": 10
        }
    },
    {
        "settingId": "scm.showActionButton",
        "desc": " Controls whether an action button can be shown in the Source Control view.",
        "setting": {
            "scm.showActionButton": true
        }
    },
    {
        "settingId": "scm.showChangesSummary",
        "desc": " Controls whether the All Changes entry is shown for incoming/outgoing changes in the Source Control view.",
        "setting": {
            "scm.showChangesSummary": true
        }
    },
    {
        "settingId": "scm.showIncomingChanges",
        "desc": " Controls whether incoming changes are shown in the Source Control view.\n  - always: Always show incoming changes in the Source Control view.\n  - never: Never show incoming changes in the Source Control view.\n  - auto: Only show incoming changes in the Source Control view when any exist.",
        "setting": {
            "scm.showIncomingChanges": "auto"
        }
    },
    {
        "settingId": "scm.showInputActionButton",
        "desc": " Controls whether an action button can be shown in the Source Control input.",
        "setting": {
            "scm.showInputActionButton": true
        }
    },
    {
        "settingId": "scm.showOutgoingChanges",
        "desc": " Controls whether outgoing changes are shown in the Source Control view.\n  - always: Always show outgoing changes in the Source Control view.\n  - never: Never show outgoing changes in the Source Control view.\n  - auto: Only show outgoing changes in the Source Control view when any exist.",
        "setting": {
            "scm.showOutgoingChanges": "auto"
        }
    },
    {
        "settingId": "scm.workingSets.default",
        "desc": " Controls the default working set to use when switching to a source control history item group that does not have a working set.\n  - empty: Use an empty working set when switching to a source control history item group that does not have a working set.\n  - current: Use the current working set when switching to a source control history item group that does not have a working set.",
        "setting": {
            "scm.workingSets.default": "current"
        }
    },
    {
        "settingId": "scm.workingSets.enabled",
        "desc": " Controls whether to store editor working sets when switching between source control history item groups.",
        "setting": {
            "scm.workingSets.enabled": false
        }
    }
]